// 只輸出部分九九乘法表內容
// 以下用 Count9x9 這支程式碼改用 continue 設計

package CH6;

public class PartOf9x9 {
    public static void main(String[] args) {
        outloop: for (int x = 1; x <= 9; x++) {
            for (int y = 1; y <= 9; y++) {
                if (x * y > 25) {           // 判斷(若乘績>25) 進到{}做迴圈的敘述
                    System.out.println();   // println換行
                    continue outloop;       // 跳到下一輪的 outloop 迴圈，即跳到第６行
                }
                System.out.print(x + "*" + y + "=" + x * y + "\t");
            }
            System.out.println();
        }
    }
}

/*
1*1=1	1*2=2	1*3=3	1*4=4	1*5=5	1*6=6	1*7=7	1*8=8	1*9=9
2*1=2	2*2=4	2*3=6	2*4=8	2*5=10	2*6=12	2*7=14	2*8=16	2*9=18
3*1=3	3*2=6	3*3=9	3*4=12	3*5=15	3*6=18	3*7=21	3*8=24
4*1=4	4*2=8	4*3=12	4*4=16	4*5=20	4*6=24
5*1=5	5*2=10	5*3=15	5*4=20	5*5=25
6*1=6	6*2=12	6*3=18	6*4=24
7*1=7	7*2=14	7*3=21
8*1=8	8*2=16	8*3=24
9*1=9	9*2=18
*/